modules/budget/sync/vm/README.md
```mermaid
graph TD
accountmodel["account:model"]
apiactual["api:actual"]
budgetdata["budget:data"]
budgetdi["budget:di"]
budgetencryption["budget:encryption"]
budgetmodel["budget:model"]
budgetsyncvm["budget:sync:vm"]
codegenannotation["codegen:annotation"]
coredi["core:di"]
coremodel["core:model"]
logging["logging"]
prefs["prefs"]
style accountmodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style apiactual fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style budgetdata fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style budgetdi fill:#FCB103,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style budgetencryption fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style budgetmodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style budgetsyncvm fill:#F5A6A6,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style codegenannotation fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coredi fill:#FCB103,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coremodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style logging fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style prefs fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
apiactual --> accountmodel
apiactual --> budgetmodel
apiactual -.-> codegenannotation
apiactual --> coremodel
budgetdata --> budgetmodel
budgetdata --> coremodel
budgetdata -.-> logging
budgetdi --> budgetdata
budgetencryption --> accountmodel
budgetencryption --> budgetmodel
budgetencryption --> coremodel
budgetsyncvm -.-> accountmodel
budgetsyncvm -.-> apiactual
budgetsyncvm --> budgetdi
budgetsyncvm --> budgetencryption
budgetsyncvm --> budgetmodel
budgetsyncvm --> coredi
budgetsyncvm -.-> coremodel
budgetsyncvm -.-> logging
budgetsyncvm -.-> prefs
prefs --> accountmodel
prefs --> coremodel
```
