modules/budget/sync/vm/modules.dot
digraph {
edge ["dir"="forward"]
graph ["dpi"="100","fontsize"="30","ranksep"="1.5","rankdir"="TB"]
node ["style"="filled"]
":account:model" ["fillcolor"="#9D8DF1","shape"="none"]
":api:actual" ["fillcolor"="#9D8DF1","shape"="none"]
":budget:data" ["fillcolor"="#9D8DF1","shape"="none"]
":budget:encryption" ["fillcolor"="#9D8DF1","shape"="none"]
":budget:model" ["fillcolor"="#9D8DF1","shape"="none"]
":budget:sync:vm" ["fillcolor"="#F5A6A6","color"="black","penwidth"="3","shape"="box"]
":codegen:annotation" ["fillcolor"="#9D8DF1","shape"="none"]
":core:di" ["fillcolor"="#FCB103","shape"="none"]
":core:model" ["fillcolor"="#9D8DF1","shape"="none"]
":logging" ["fillcolor"="#9D8DF1","shape"="none"]
":prefs" ["fillcolor"="#9D8DF1","shape"="none"]
":api:actual" -> ":account:model"
":api:actual" -> ":budget:model"
":api:actual" -> ":codegen:annotation" ["style"="dotted"]
":api:actual" -> ":core:model"
":budget:data" -> ":budget:model"
":budget:data" -> ":core:model"
":budget:data" -> ":logging" ["style"="dotted"]
":budget:encryption" -> ":account:model"
":budget:encryption" -> ":budget:model"
":budget:encryption" -> ":core:model"
":budget:sync:vm" -> ":account:model" ["style"="dotted"]
":budget:sync:vm" -> ":api:actual" ["style"="dotted"]
":budget:sync:vm" -> ":budget:encryption"
":budget:sync:vm" -> ":budget:model"
":budget:sync:vm" -> ":core:di"
":budget:sync:vm" -> ":core:model" ["style"="dotted"]
":budget:sync:vm" -> ":logging" ["style"="dotted"]
":budget:sync:vm" -> ":prefs" ["style"="dotted"]
":core:di" -> ":budget:data"
":core:di" -> ":budget:model"
":prefs" -> ":account:model"
":prefs" -> ":core:model"
}
